from flask import Blueprint, request, render_template, session, redirect, flash
import numpy as np
import pandas as pd
import hashlib, base64, json

health_bp1 = Blueprint('health_bp1', __name__)

def age_gen(a) :
    age_12 = 123 - int(str(a)[:2])
    age_34 = 23 - int(str(a)[:2])
    if str(a)[-1] == '1':
        return '남성', age_12
    elif str(a)[-1] == '2':
        return '여성', age_12
    elif str(a)[-1] == '3':
        return '남성', age_34
    else:
        return '여성', age_34

@health_bp1.route('/body', methods=['GET', 'POST'])
def age():
    male = [{'연령': '20~24세', '비율': 0.96},{'연령': '25~29세', '비율': 3.55},{'연령': '30~34세', '비율': 4.97},
            {'연령': '35~39세', '비율': 6.04},{'연령': '40~44세', '비율': 6.76},{'연령': '45~49세', '비율': 6.27},
            {'연령': '50~54세', '비율': 6.63},{'연령': '55~59세', '비율': 5.63},{'연령': '60~64세', '비율': 5.23},
            {'연령': '65~69세', '비율': 2.88},{'연령': '70~74세', '비율': 2.52},{'연령': '75~79세', '비율': 1.27},
            {'연령': '80~84세', '비율': 0.71},{'연령': '85세+', '비율': 0.12}]   
    female = [{'연령': '20~24세', '비율': 1.17},{'연령': '25~29세', '비율': 2.99},{'연령': '30~34세', '비율': 2.78},
              {'연령': '35~39세', '비율': 2.67},{'연령': '40~44세', '비율': 5.48},{'연령': '45~49세', '비율': 5.26},
              {'연령': '50~54세', '비율': 6.52},{'연령': '55~59세', '비율': 5.51},{'연령': '60~64세', '비율': 5.51},
              {'연령': '65~69세', '비율': 2.96},{'연령': '70~74세', '비율': 2.78},{'연령': '75~79세', '비율': 1.55},
              {'연령': '80~84세', '비율': 0.98},{'연령': '85세+', '비율': 0.26}]
    
    M_height = [{'신장': 145, '비율': 0.03},{'신장': 150, '비율': 0.58},{'신장': 155, '비율': 3.66},{'신장': 160, '비율': 13.2},
            {'신장': 165, '비율': 25.56},{'신장': 170, '비율': 29.86},{'신장': 175, '비율': 18.79},{'신장': 180, '비율': 6.97},
            {'신장': 185, '비율': 1.28},{'신장': 190, '비율': 0.08}]  
    W_height =[{'신장': 125, '비율': 0.0},{'신장': 130, '비율': 0.02},{'신장': 135, '비율': 0.27},{'신장': 140, '비율': 2.1},
            {'신장': 145, '비율': 8.66},{'신장': 150, '비율': 22.52},{'신장': 155, '비율': 31.26},{'신장': 160, '비율': 23.97},
            {'신장': 165, '비율': 9.31},{'신장': 170, '비율': 1.77},{'신장': 175, '비율': 0.1},{'신장': 180, '비율': 0.0}]
    
    M_weight = [{'체중': 40, '비율': 0.1},{'체중': 45, '비율': 0.77},{'체중': 50, '비율': 2.98},{'체중': 55, '비율': 7.13},{'체중': 60, '비율': 13.17},
                {'체중': 65, '비율': 17.9},{'체중': 70, '비율': 18.84},{'체중': 75, '비율': 15.15},{'체중': 80, '비율': 10.39},{'체중': 85, '비율': 6.16},
                {'체중': 90, '비율': 3.49},{'체중': 95, '비율': 1.91},{'체중': 100, '비율': 1.02},{'체중': 105, '비율': 0.51},{'체중': 110, '비율': 0.26},{'체중': 115, '비율': 0.12},
                {'체중': 120, '비율': 0.06},{'체중': 125, '비율': 0.02},{'체중': 130, '비율': 0.01},{'체중': 135, '비율': 0.0}] 
    W_weight =[{'체중': 30, '비율': 0.03},{'체중': 35, '비율': 0.46},{'체중': 40, '비율': 3.5},{'체중': 45, '비율': 12.55},{'체중': 50, '비율': 23.23},
                {'체중': 55, '비율': 23.88},{'체중': 60, '비율': 17.17},{'체중': 65, '비율': 9.75},{'체중': 70, '비율': 4.95},{'체중': 75, '비율': 2.47},
                {'체중': 80, '비율': 1.15},{'체중': 85, '비율': 0.56},{'체중': 90, '비율': 0.23},{'체중': 95, '비율': 0.1},{'체중': 100, '비율': 0.04},
                {'체중': 105, '비율': 0.01},{'체중': 110, '비율': 0.01},{'체중': 115, '비율': 0.0}]
        
    if request.method == 'GET':
        return render_template('my_body.html',)
    else:
        jm = int(request.values["jm"])
        height =int(request.values["height"])
        weight =int(request.values["weight"])
        gender = age_gen(jm)[0]
        age = age_gen(jm)[1]
        b=1
        c=1
        d=1
        for i, j in zip(np.arange(20, 100, 5), np.arange(24, 104, 5)):
            if i <= age <= j:        #사용자 나이
                break
            else:
                b = b + 1    #몇번째 해당하는지 알려주는
        if gender == '여성':
            for a, b in zip(np.arange(120, 176, 5), np.arange(125, 181, 5)):
                if a <= height <= b:      
                    break
                else:
                    c = c + 1   
        elif gender == '남성':
            for i, j in zip(np.arange(140, 186, 5), np.arange(145, 191, 5)):
                if i <= height <= j:       
                    break
                else:
                    c = c + 1  
        if gender == '여성':
            for i, j in zip(np.arange(25, 111, 5), np.arange(30, 116, 5)):
                if i <= weight <= j:       
                    break
                else:
                    d = d + 1  

        elif gender == '남성':
            for i, j in zip(np.arange(35, 131, 5), np.arange(40, 136, 5)):
                if i <= weight <= j:      
                    break
                else:
                    d = d + 1  

        if gender == '남성':    
            return render_template('my_body.html', age_list = male,age=str(age),height_list=M_height,weight_list=M_weight, gender=gender, b=b,c=c,d=d)
        
        elif gender == '여성':
            return render_template('my_body.html', age_list = female,age=str(age),height_list=W_height, weight_list=W_weight,gender=gender, b=b)
        